## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 443 to add, 33 to change, 1 to destroy.</code></pre>

* Create
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_application.app
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_application_password.token
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuread_service_principal.sp
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;Access to Azure Active Directory&#34;].azurerm_subscription.this
  * module.subscription[&#34;Access to Azure Active Directory&#34;].random_uuid.app_uuid
  * module.subscription[&#34;Access to Azure Active Directory&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-RDO-Production&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].time_rotating.rotation_period
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuread_service_principal.sp
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].time_rotating.rotation_period
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_application.app
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_application_password.token
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuread_service_principal.sp
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].random_uuid.app_uuid
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].time_rotating.rotation_period
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_application.app
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuread_service_principal.sp
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].random_uuid.app_uuid
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].time_rotating.rotation_period
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_application.app
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuread_service_principal.sp
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Production&#34;].random_uuid.app_uuid
  * module.subscription[&#34;MoJ Common Platform Production&#34;].time_rotating.rotation_period
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_application.app
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuread_service_principal.sp
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].random_uuid.app_uuid
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].time_rotating.rotation_period
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_application.app
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuread_service_principal.sp
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].random_uuid.app_uuid
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].time_rotating.rotation_period
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_application.app
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_application_password.token
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuread_service_principal.sp
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].random_uuid.app_uuid
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].time_rotating.rotation_period
* Update
  * module.enterprise.azurerm_management_group.level_2[&#34;Crime&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-Prod&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-Sandbox&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Heritage-Prod&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-Prod&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-Sandbox&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_application.app
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_subscription.this
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_application.app
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_subscription.this
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_subscription.this
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_subscription.this
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_subscription.this
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_subscription.this
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_subscription.this
* Replace
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_2["Crime"] will be updated in-place
  ~ resource "azurerm_management_group" "level_2" {
        id                         = "/providers/Microsoft.Management/managementGroups/Crime"
        name                       = "Crime"
      ~ subscription_ids           = [
          + "55c2f45e-1381-4b17-9bd0-f85215b8bb4f",
          + "5ff94e9e-4276-4e4b-b36b-475101d613d4",
          + "6491a35d-b1cc-4823-8340-0b847abc9a1b",
          + "79898897-729c-41a0-a5ca-53c764839d95",
          + "c7d20737-15ae-45da-bec4-67da9c029ddc",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["CFT-Prod"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
        name                       = "CFT-Prod"
      ~ subscription_ids           = [
          + "abe4bc04-16e5-42dd-9aad-464f70ebc2ce",
            # (5 unchanged elements hidden)
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["CFT-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
        name                       = "CFT-Sandbox"
      ~ subscription_ids           = [
          + "cdc31e8e-43f4-4c8a-8b50-635e954c27d3",
            # (2 unchanged elements hidden)
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Heritage-Prod"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
        name                       = "Heritage-Prod"
      ~ subscription_ids           = [
          + "61432c17-4377-4780-be02-d56e56ef2b07",
            # (2 unchanged elements hidden)
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Platform-Prod"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
        name                       = "Platform-Prod"
      ~ subscription_ids           = [
          - "04d27a32-7a07-48b3-95b8-3c8691e1a263",
          - "0978315c-75fe-4ada-9d11-1eb5e0e0b214",
          - "2b1afc19-5ca9-4796-a56f-574a58670244",
          - "ed302caf-ec27-4c64-a05e-85731c3ce90e",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Platform-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
        name                       = "Platform-Sandbox"
      ~ subscription_ids           = [
          + "1fe7db01-9981-4ed3-983c-163dd50ba43a",
            # (4 unchanged elements hidden)
        ]
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Bootstrap (sub:access to azure active directory)"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:access to azure active directory) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:access to azure active directory)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:access to azure active directory) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:access to azure active directory)"
              + value                      = "user_impersonation"
            }
        }

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }

      + web {
          + homepage_url = "https://dev.azure.com/hmcts/PlatformOperations"

          + implicit_grant {
              + access_token_issuance_enabled = false
              + id_token_issuance_enabled     = true
            }
        }
    }

  # module.subscription["Access to Azure Active Directory"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the Access to Azure Active Directory subscription"
      + display_name                   = "DTS AKS Administrators (sub:access to azure active directory)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the Access to Azure Active Directory subscription"
      + display_name                   = "DTS AKS Users (sub:access to azure active directory)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group.groups["Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants contributor permissions to the Access to Azure Active Directory subscription"
      + display_name                   = "DTS Contributors (sub:access to azure active directory)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the Access to Azure Active Directory subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:access to azure active directory)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group.groups["Owner"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants owner permissions to the Access to Azure Active Directory subscription"
      + display_name                   = "DTS Owners (sub:access to azure active directory)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group.groups["Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants reader permissions to the Access to Azure Active Directory subscription"
      + display_name                   = "DTS Readers (sub:access to azure active directory)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the Access to Azure Active Directory subscription"
      + display_name                   = "DTS Security Readers (sub:access to azure active directory)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group.groups["Storage Blob Data Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants storage blob data contributor permissions to the Access to Azure Active Directory subscription"
      + display_name                   = "DTS Blob Readers (sub:access to azure active directory)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["Access to Azure Active Directory"].azuread_group_member.members["Contributor-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id   

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

  + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_groups["Contributor"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_groups["Owner"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_groups["Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_groups["Storage Blob Data Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_role_assignments["Monitoring Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Contributor"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_role_assignments["Network Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "cabe4bc04464f70ebc2cesa"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azure-control-sbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_storage_container.sc will be created
  + resource "azurerm_storage_container" "sc" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "subscription-tfstate"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "cabe4bc04464f70ebc2cesa"
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_subscription.this will be updated in-place
  ~ resource "azurerm_subscription" "this" {
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
        id                = "/providers/Microsoft.Subscription/aliases/Reform-CFT-MI-SB"
        tags              = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-MI-SB"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["Reform-CFT-MI-SB"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 443 to add, 33 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":55,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->